summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxMcds_reg.h
/**
 * \file IfxMcds_reg.h
 * \brief
 * \copyright Copyright (c) 2012 Infineon Technologies AG. All rights reserved.
 *
 *
 * $Revision: 1585 $
 * $Date: 2013-09-03 13:30:24 +0200 (Di, 03 Sep 2013) $
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Mcds_Cfg Mcds address
 * \ingroup IfxLld_Mcds
 * 
 * \defgroup IfxLld_Mcds_Cfg_BaseAddress Base address
 * \ingroup IfxLld_Mcds_Cfg
 * 
 * \defgroup IfxLld_Mcds_Cfg_Mcds 2-MCDS
 * \ingroup IfxLld_Mcds_Cfg
 * 
 */
#ifndef IFXMCDS_REG_H
#define IFXMCDS_REG_H
/******************************************************************************/
#include "IfxMcds_regdef.h"
/******************************************************************************/
/** \addtogroup IfxLld_Mcds_Cfg_BaseAddress
 * \{  */

/** \\brief  MCDS object */
#define MODULE_MCDS /*lint --e(923)*/ ((*(Ifx_MCDS*)0xF90E8000u))
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mcds_Cfg_Mcds
 * \{  */

/** \\brief  0, Clock Control Register */
#define MCDS_CLC /*lint --e(923)*/ (*(volatile Ifx_MCDS_CLC*)0xF90E8000u)

/** \\brief  10, MCDS Control Register */
#define MCDS_CT /*lint --e(923)*/ (*(volatile Ifx_MCDS_CT*)0xF90E8010u)

/** \\brief  204, Trace Buffer Bottom Register */
#define MCDS_FIFOBOT /*lint --e(923)*/ (*(volatile Ifx_MCDS_FIFOBOT*)0xF90E8204u)

/** \\brief  210, Trace Buffer Control Register */
#define MCDS_FIFOCTL /*lint --e(923)*/ (*(volatile Ifx_MCDS_FIFOCTL*)0xF90E8210u)

/** \\brief  200, Trace Buffer Write Pointer */
#define MCDS_FIFONOW /*lint --e(923)*/ (*(volatile Ifx_MCDS_FIFONOW*)0xF90E8200u)

/** \\brief  208, Trace Buffer PRE/POST Register */
#define MCDS_FIFOPRE /*lint --e(923)*/ (*(volatile Ifx_MCDS_FIFOPRE*)0xF90E8208u)

/** \\brief  20C, Trace Buffer Top Register */
#define MCDS_FIFOTOP /*lint --e(923)*/ (*(volatile Ifx_MCDS_FIFOTOP*)0xF90E820Cu)

/** \\brief  214, Trace Buffer Comparator Register */
#define MCDS_FIFOWARN0 /*lint --e(923)*/ (*(volatile Ifx_MCDS_FIFOWARN0*)0xF90E8214u)

/** \\brief  218, Trace Buffer Comparator Register */
#define MCDS_FIFOWARN1 /*lint --e(923)*/ (*(volatile Ifx_MCDS_FIFOWARN1*)0xF90E8218u)

/** \\brief  8, Module Identification Register */
#define MCDS_ID /*lint --e(923)*/ (*(volatile Ifx_MCDS_ID*)0xF90E8008u)

/** \\brief  880, Action Definition Register */
#define MCDS_MCX_ACT0 /*lint --e(923)*/ (*(volatile Ifx_MCDS_ACT*)0xF90E8880u)

/** Alias (User Manual Name) for MCDS_MCX_ACT0.
* To use register names with standard convension, please use MCDS_MCX_ACT0.
*/
#define	MCDS_MCXACT0	(MCDS_MCX_ACT0)

/** \\brief  884, Action Definition Register */
#define MCDS_MCX_ACT1 /*lint --e(923)*/ (*(volatile Ifx_MCDS_ACT*)0xF90E8884u)

/** Alias (User Manual Name) for MCDS_MCX_ACT1.
* To use register names with standard convension, please use MCDS_MCX_ACT1.
*/
#define	MCDS_MCXACT1	(MCDS_MCX_ACT1)

/** \\brief  8A8, Action Definition Register */
#define MCDS_MCX_ACT10 /*lint --e(923)*/ (*(volatile Ifx_MCDS_ACT*)0xF90E88A8u)

/** Alias (User Manual Name) for MCDS_MCX_ACT10.
* To use register names with standard convension, please use MCDS_MCX_ACT10.
*/
#define	MCDS_MCXACT10	(MCDS_MCX_ACT10)

/** \\brief  8AC, Action Definition Register */
#define MCDS_MCX_ACT11 /*lint --e(923)*/ (*(volatile Ifx_MCDS_ACT*)0xF90E88ACu)

/** Alias (User Manual Name) for MCDS_MCX_ACT11.
* To use register names with standard convension, please use MCDS_MCX_ACT11.
*/
#define	MCDS_MCXACT11	(MCDS_MCX_ACT11)

/** \\brief  8B0, Action Definition Register */
#define MCDS_MCX_ACT12 /*lint --e(923)*/ (*(volatile Ifx_MCDS_ACT*)0xF90E88B0u)

/** Alias (User Manual Name) for MCDS_MCX_ACT12.
* To use register names with standard convension, please use MCDS_MCX_ACT12.
*/
#define	MCDS_MCXACT12	(MCDS_MCX_ACT12)

/** \\brief  8B4, Action Definition Register */
#define MCDS_MCX_ACT13 /*lint --e(923)*/ (*(volatile Ifx_MCDS_ACT*)0xF90E88B4u)

/** Alias (User Manual Name) for MCDS_MCX_ACT13.
* To use register names with standard convension, please use MCDS_MCX_ACT13.
*/
#define	MCDS_MCXACT13	(MCDS_MCX_ACT13)

/** \\brief  8B8, Action Definition Register */
#define MCDS_MCX_ACT14 /*lint --e(923)*/ (*(volatile Ifx_MCDS_ACT*)0xF90E88B8u)

/** Alias (User Manual Name) for MCDS_MCX_ACT14.
* To use register names with standard convension, please use MCDS_MCX_ACT14.
*/
#define	MCDS_MCXACT14	(MCDS_MCX_ACT14)

/** \\brief  8BC, Action Definition Register */
#define MCDS_MCX_ACT15 /*lint --e(923)*/ (*(volatile Ifx_MCDS_ACT*)0xF90E88BCu)

/** Alias (User Manual Name) for MCDS_MCX_ACT15.
* To use register names with standard convension, please use MCDS_MCX_ACT15.
*/
#define	MCDS_MCXACT15	(MCDS_MCX_ACT15)

/** \\brief  8C0, Action Definition Register */
#define MCDS_MCX_ACT16 /*lint --e(923)*/ (*(volatile Ifx_MCDS_ACT*)0xF90E88C0u)

/** Alias (User Manual Name) for MCDS_MCX_ACT16.
* To use register names with standard convension, please use MCDS_MCX_ACT16.
*/
#define	MCDS_MCXACT16	(MCDS_MCX_ACT16)

/** \\brief  8C4, Action Definition Register */
#define MCDS_MCX_ACT17 /*lint --e(923)*/ (*(volatile Ifx_MCDS_ACT*)0xF90E88C4u)

/** Alias (User Manual Name) for MCDS_MCX_ACT17.
* To use register names with standard convension, please use MCDS_MCX_ACT17.
*/
#define	MCDS_MCXACT17	(MCDS_MCX_ACT17)

/** \\brief  8C8, Action Definition Register */
#define MCDS_MCX_ACT18 /*lint --e(923)*/ (*(volatile Ifx_MCDS_ACT*)0xF90E88C8u)

/** Alias (User Manual Name) for MCDS_MCX_ACT18.
* To use register names with standard convension, please use MCDS_MCX_ACT18.
*/
#define	MCDS_MCXACT18	(MCDS_MCX_ACT18)

