summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxMcds_reg.h
/** \\brief  8CC, Action Definition Register */
#define MCDS_MCX_ACT19 /*lint --e(923)*/ (*(volatile Ifx_MCDS_ACT*)0xF90E88CCu)

/** Alias (User Manual Name) for MCDS_MCX_ACT19.
* To use register names with standard convension, please use MCDS_MCX_ACT19.
*/
#define	MCDS_MCXACT19	(MCDS_MCX_ACT19)

/** \\brief  888, Action Definition Register */
#define MCDS_MCX_ACT2 /*lint --e(923)*/ (*(volatile Ifx_MCDS_ACT*)0xF90E8888u)

/** Alias (User Manual Name) for MCDS_MCX_ACT2.
* To use register names with standard convension, please use MCDS_MCX_ACT2.
*/
#define	MCDS_MCXACT2	(MCDS_MCX_ACT2)

/** \\brief  8D0, Action Definition Register */
#define MCDS_MCX_ACT20 /*lint --e(923)*/ (*(volatile Ifx_MCDS_ACT*)0xF90E88D0u)

/** Alias (User Manual Name) for MCDS_MCX_ACT20.
* To use register names with standard convension, please use MCDS_MCX_ACT20.
*/
#define	MCDS_MCXACT20	(MCDS_MCX_ACT20)

/** \\brief  8D4, Action Definition Register */
#define MCDS_MCX_ACT21 /*lint --e(923)*/ (*(volatile Ifx_MCDS_ACT*)0xF90E88D4u)

/** Alias (User Manual Name) for MCDS_MCX_ACT21.
* To use register names with standard convension, please use MCDS_MCX_ACT21.
*/
#define	MCDS_MCXACT21	(MCDS_MCX_ACT21)

/** \\brief  8D8, Action Definition Register */
#define MCDS_MCX_ACT22 /*lint --e(923)*/ (*(volatile Ifx_MCDS_ACT*)0xF90E88D8u)

/** Alias (User Manual Name) for MCDS_MCX_ACT22.
* To use register names with standard convension, please use MCDS_MCX_ACT22.
*/
#define	MCDS_MCXACT22	(MCDS_MCX_ACT22)

/** \\brief  8DC, Action Definition Register */
#define MCDS_MCX_ACT23 /*lint --e(923)*/ (*(volatile Ifx_MCDS_ACT*)0xF90E88DCu)

/** Alias (User Manual Name) for MCDS_MCX_ACT23.
* To use register names with standard convension, please use MCDS_MCX_ACT23.
*/
#define	MCDS_MCXACT23	(MCDS_MCX_ACT23)

/** \\brief  8E0, Action Definition Register */
#define MCDS_MCX_ACT24 /*lint --e(923)*/ (*(volatile Ifx_MCDS_ACT*)0xF90E88E0u)

/** Alias (User Manual Name) for MCDS_MCX_ACT24.
* To use register names with standard convension, please use MCDS_MCX_ACT24.
*/
#define	MCDS_MCXACT24	(MCDS_MCX_ACT24)

/** \\brief  8E4, Action Definition Register */
#define MCDS_MCX_ACT25 /*lint --e(923)*/ (*(volatile Ifx_MCDS_ACT*)0xF90E88E4u)

/** Alias (User Manual Name) for MCDS_MCX_ACT25.
* To use register names with standard convension, please use MCDS_MCX_ACT25.
*/
#define	MCDS_MCXACT25	(MCDS_MCX_ACT25)

/** \\brief  8E8, Action Definition Register */
#define MCDS_MCX_ACT26 /*lint --e(923)*/ (*(volatile Ifx_MCDS_ACT*)0xF90E88E8u)

/** Alias (User Manual Name) for MCDS_MCX_ACT26.
* To use register names with standard convension, please use MCDS_MCX_ACT26.
*/
#define	MCDS_MCXACT26	(MCDS_MCX_ACT26)

/** \\brief  8EC, Action Definition Register */
#define MCDS_MCX_ACT27 /*lint --e(923)*/ (*(volatile Ifx_MCDS_ACT*)0xF90E88ECu)

/** Alias (User Manual Name) for MCDS_MCX_ACT27.
* To use register names with standard convension, please use MCDS_MCX_ACT27.
*/
#define	MCDS_MCXACT27	(MCDS_MCX_ACT27)

/** \\brief  8F0, Action Definition Register */
#define MCDS_MCX_ACT28 /*lint --e(923)*/ (*(volatile Ifx_MCDS_ACT*)0xF90E88F0u)

/** Alias (User Manual Name) for MCDS_MCX_ACT28.
* To use register names with standard convension, please use MCDS_MCX_ACT28.
*/
#define	MCDS_MCXACT28	(MCDS_MCX_ACT28)

/** \\brief  8F4, Action Definition Register */
#define MCDS_MCX_ACT29 /*lint --e(923)*/ (*(volatile Ifx_MCDS_ACT*)0xF90E88F4u)

/** Alias (User Manual Name) for MCDS_MCX_ACT29.
* To use register names with standard convension, please use MCDS_MCX_ACT29.
*/
#define	MCDS_MCXACT29	(MCDS_MCX_ACT29)

/** \\brief  88C, Action Definition Register */
#define MCDS_MCX_ACT3 /*lint --e(923)*/ (*(volatile Ifx_MCDS_ACT*)0xF90E888Cu)

/** Alias (User Manual Name) for MCDS_MCX_ACT3.
* To use register names with standard convension, please use MCDS_MCX_ACT3.
*/
#define	MCDS_MCXACT3	(MCDS_MCX_ACT3)

/** \\brief  8F8, Action Definition Register */
#define MCDS_MCX_ACT30 /*lint --e(923)*/ (*(volatile Ifx_MCDS_ACT*)0xF90E88F8u)

/** Alias (User Manual Name) for MCDS_MCX_ACT30.
* To use register names with standard convension, please use MCDS_MCX_ACT30.
*/
#define	MCDS_MCXACT30	(MCDS_MCX_ACT30)

/** \\brief  8FC, Action Definition Register */
#define MCDS_MCX_ACT31 /*lint --e(923)*/ (*(volatile Ifx_MCDS_ACT*)0xF90E88FCu)

/** Alias (User Manual Name) for MCDS_MCX_ACT31.
* To use register names with standard convension, please use MCDS_MCX_ACT31.
*/
#define	MCDS_MCXACT31	(MCDS_MCX_ACT31)

/** \\brief  900, Action Definition Register */
#define MCDS_MCX_ACT32 /*lint --e(923)*/ (*(volatile Ifx_MCDS_ACT*)0xF90E8900u)

/** Alias (User Manual Name) for MCDS_MCX_ACT32.
* To use register names with standard convension, please use MCDS_MCX_ACT32.
*/
#define	MCDS_MCXACT32	(MCDS_MCX_ACT32)

/** \\brief  904, Action Definition Register */
#define MCDS_MCX_ACT33 /*lint --e(923)*/ (*(volatile Ifx_MCDS_ACT*)0xF90E8904u)

/** Alias (User Manual Name) for MCDS_MCX_ACT33.
* To use register names with standard convension, please use MCDS_MCX_ACT33.
*/
#define	MCDS_MCXACT33	(MCDS_MCX_ACT33)

/** \\brief  908, Action Definition Register */
#define MCDS_MCX_ACT34 /*lint --e(923)*/ (*(volatile Ifx_MCDS_ACT*)0xF90E8908u)

/** Alias (User Manual Name) for MCDS_MCX_ACT34.
* To use register names with standard convension, please use MCDS_MCX_ACT34.
*/
#define	MCDS_MCXACT34	(MCDS_MCX_ACT34)

/** \\brief  90C, Action Definition Register */
#define MCDS_MCX_ACT35 /*lint --e(923)*/ (*(volatile Ifx_MCDS_ACT*)0xF90E890Cu)

/** Alias (User Manual Name) for MCDS_MCX_ACT35.
* To use register names with standard convension, please use MCDS_MCX_ACT35.
*/
#define	MCDS_MCXACT35	(MCDS_MCX_ACT35)

/** \\brief  910, Action Definition Register */
#define MCDS_MCX_ACT36 /*lint --e(923)*/ (*(volatile Ifx_MCDS_ACT*)0xF90E8910u)

/** Alias (User Manual Name) for MCDS_MCX_ACT36.
* To use register names with standard convension, please use MCDS_MCX_ACT36.
*/
#define	MCDS_MCXACT36	(MCDS_MCX_ACT36)

/** \\brief  914, Action Definition Register */
#define MCDS_MCX_ACT37 /*lint --e(923)*/ (*(volatile Ifx_MCDS_ACT*)0xF90E8914u)

