summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxMcds_reg.h
/** Alias (User Manual Name) for MCDS_MCX_ACT37.
* To use register names with standard convension, please use MCDS_MCX_ACT37.
*/
#define	MCDS_MCXACT37	(MCDS_MCX_ACT37)

/** \\brief  918, Action Definition Register */
#define MCDS_MCX_ACT38 /*lint --e(923)*/ (*(volatile Ifx_MCDS_ACT*)0xF90E8918u)

/** Alias (User Manual Name) for MCDS_MCX_ACT38.
* To use register names with standard convension, please use MCDS_MCX_ACT38.
*/
#define	MCDS_MCXACT38	(MCDS_MCX_ACT38)

/** \\brief  91C, Action Definition Register */
#define MCDS_MCX_ACT39 /*lint --e(923)*/ (*(volatile Ifx_MCDS_ACT*)0xF90E891Cu)

/** Alias (User Manual Name) for MCDS_MCX_ACT39.
* To use register names with standard convension, please use MCDS_MCX_ACT39.
*/
#define	MCDS_MCXACT39	(MCDS_MCX_ACT39)

/** \\brief  890, Action Definition Register */
#define MCDS_MCX_ACT4 /*lint --e(923)*/ (*(volatile Ifx_MCDS_ACT*)0xF90E8890u)

/** Alias (User Manual Name) for MCDS_MCX_ACT4.
* To use register names with standard convension, please use MCDS_MCX_ACT4.
*/
#define	MCDS_MCXACT4	(MCDS_MCX_ACT4)

/** \\brief  920, Action Definition Register */
#define MCDS_MCX_ACT40 /*lint --e(923)*/ (*(volatile Ifx_MCDS_ACT*)0xF90E8920u)

/** Alias (User Manual Name) for MCDS_MCX_ACT40.
* To use register names with standard convension, please use MCDS_MCX_ACT40.
*/
#define	MCDS_MCXACT40	(MCDS_MCX_ACT40)

/** \\brief  924, Action Definition Register */
#define MCDS_MCX_ACT41 /*lint --e(923)*/ (*(volatile Ifx_MCDS_ACT*)0xF90E8924u)

/** Alias (User Manual Name) for MCDS_MCX_ACT41.
* To use register names with standard convension, please use MCDS_MCX_ACT41.
*/
#define	MCDS_MCXACT41	(MCDS_MCX_ACT41)

/** \\brief  928, Action Definition Register */
#define MCDS_MCX_ACT42 /*lint --e(923)*/ (*(volatile Ifx_MCDS_ACT*)0xF90E8928u)

/** Alias (User Manual Name) for MCDS_MCX_ACT42.
* To use register names with standard convension, please use MCDS_MCX_ACT42.
*/
#define	MCDS_MCXACT42	(MCDS_MCX_ACT42)

/** \\brief  92C, Action Definition Register */
#define MCDS_MCX_ACT43 /*lint --e(923)*/ (*(volatile Ifx_MCDS_ACT*)0xF90E892Cu)

/** Alias (User Manual Name) for MCDS_MCX_ACT43.
* To use register names with standard convension, please use MCDS_MCX_ACT43.
*/
#define	MCDS_MCXACT43	(MCDS_MCX_ACT43)

/** \\brief  930, Action Definition Register */
#define MCDS_MCX_ACT44 /*lint --e(923)*/ (*(volatile Ifx_MCDS_ACT*)0xF90E8930u)

/** Alias (User Manual Name) for MCDS_MCX_ACT44.
* To use register names with standard convension, please use MCDS_MCX_ACT44.
*/
#define	MCDS_MCXACT44	(MCDS_MCX_ACT44)

/** \\brief  894, Action Definition Register */
#define MCDS_MCX_ACT5 /*lint --e(923)*/ (*(volatile Ifx_MCDS_ACT*)0xF90E8894u)

/** Alias (User Manual Name) for MCDS_MCX_ACT5.
* To use register names with standard convension, please use MCDS_MCX_ACT5.
*/
#define	MCDS_MCXACT5	(MCDS_MCX_ACT5)

/** \\brief  898, Action Definition Register */
#define MCDS_MCX_ACT6 /*lint --e(923)*/ (*(volatile Ifx_MCDS_ACT*)0xF90E8898u)

/** Alias (User Manual Name) for MCDS_MCX_ACT6.
* To use register names with standard convension, please use MCDS_MCX_ACT6.
*/
#define	MCDS_MCXACT6	(MCDS_MCX_ACT6)

/** \\brief  89C, Action Definition Register */
#define MCDS_MCX_ACT7 /*lint --e(923)*/ (*(volatile Ifx_MCDS_ACT*)0xF90E889Cu)

/** Alias (User Manual Name) for MCDS_MCX_ACT7.
* To use register names with standard convension, please use MCDS_MCX_ACT7.
*/
#define	MCDS_MCXACT7	(MCDS_MCX_ACT7)

/** \\brief  8A0, Action Definition Register */
#define MCDS_MCX_ACT8 /*lint --e(923)*/ (*(volatile Ifx_MCDS_ACT*)0xF90E88A0u)

/** Alias (User Manual Name) for MCDS_MCX_ACT8.
* To use register names with standard convension, please use MCDS_MCX_ACT8.
*/
#define	MCDS_MCXACT8	(MCDS_MCX_ACT8)

/** \\brief  8A4, Action Definition Register */
#define MCDS_MCX_ACT9 /*lint --e(923)*/ (*(volatile Ifx_MCDS_ACT*)0xF90E88A4u)

/** Alias (User Manual Name) for MCDS_MCX_ACT9.
* To use register names with standard convension, please use MCDS_MCX_ACT9.
*/
#define	MCDS_MCXACT9	(MCDS_MCX_ACT9)

/** \\brief  A00, Counter Control Register */
#define MCDS_MCX_CNT0_CCL /*lint --e(923)*/ (*(volatile Ifx_MCDS_CNT_CCL*)0xF90E8A00u)

/** Alias (User Manual Name) for MCDS_MCX_CNT0_CCL.
* To use register names with standard convension, please use MCDS_MCX_CNT0_CCL.
*/
#define	MCDS_MCXCCL0	(MCDS_MCX_CNT0_CCL)

/** \\brief  A08, Current Count Register */
#define MCDS_MCX_CNT0_CNT /*lint --e(923)*/ (*(volatile Ifx_MCDS_CNT_CNT*)0xF90E8A08u)

/** Alias (User Manual Name) for MCDS_MCX_CNT0_CNT.
* To use register names with standard convension, please use MCDS_MCX_CNT0_CNT.
*/
#define	MCDS_MCXCNT0	(MCDS_MCX_CNT0_CNT)

/** \\brief  A04, Counter Limit Register */
#define MCDS_MCX_CNT0_LMT /*lint --e(923)*/ (*(volatile Ifx_MCDS_CNT_LMT*)0xF90E8A04u)

/** Alias (User Manual Name) for MCDS_MCX_CNT0_LMT.
* To use register names with standard convension, please use MCDS_MCX_CNT0_LMT.
*/
#define	MCDS_MCXLMT0	(MCDS_MCX_CNT0_LMT)

/** \\brief  A10, Counter Control Register */
#define MCDS_MCX_CNT1_CCL /*lint --e(923)*/ (*(volatile Ifx_MCDS_CNT_CCL*)0xF90E8A10u)

/** Alias (User Manual Name) for MCDS_MCX_CNT1_CCL.
* To use register names with standard convension, please use MCDS_MCX_CNT1_CCL.
*/
#define	MCDS_MCXCCL1	(MCDS_MCX_CNT1_CCL)

/** \\brief  A18, Current Count Register */
#define MCDS_MCX_CNT1_CNT /*lint --e(923)*/ (*(volatile Ifx_MCDS_CNT_CNT*)0xF90E8A18u)

/** Alias (User Manual Name) for MCDS_MCX_CNT1_CNT.
* To use register names with standard convension, please use MCDS_MCX_CNT1_CNT.
*/
#define	MCDS_MCXCNT1	(MCDS_MCX_CNT1_CNT)

/** \\brief  A14, Counter Limit Register */
#define MCDS_MCX_CNT1_LMT /*lint --e(923)*/ (*(volatile Ifx_MCDS_CNT_LMT*)0xF90E8A14u)

/** Alias (User Manual Name) for MCDS_MCX_CNT1_LMT.
* To use register names with standard convension, please use MCDS_MCX_CNT1_LMT.
*/
#define	MCDS_MCXLMT1	(MCDS_MCX_CNT1_LMT)

/** \\brief  A20, Counter Control Register */
#define MCDS_MCX_CNT2_CCL /*lint --e(923)*/ (*(volatile Ifx_MCDS_CNT_CCL*)0xF90E8A20u)

/** Alias (User Manual Name) for MCDS_MCX_CNT2_CCL.
* To use register names with standard convension, please use MCDS_MCX_CNT2_CCL.
*/
#define	MCDS_MCXCCL2	(MCDS_MCX_CNT2_CCL)

/** \\brief  A28, Current Count Register */
#define MCDS_MCX_CNT2_CNT /*lint --e(923)*/ (*(volatile Ifx_MCDS_CNT_CNT*)0xF90E8A28u)

