summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxMcds_reg.h
/** Alias (User Manual Name) for MCDS_MCX_CNT2_CNT.
* To use register names with standard convension, please use MCDS_MCX_CNT2_CNT.
*/
#define	MCDS_MCXCNT2	(MCDS_MCX_CNT2_CNT)

/** \\brief  A24, Counter Limit Register */
#define MCDS_MCX_CNT2_LMT /*lint --e(923)*/ (*(volatile Ifx_MCDS_CNT_LMT*)0xF90E8A24u)

/** Alias (User Manual Name) for MCDS_MCX_CNT2_LMT.
* To use register names with standard convension, please use MCDS_MCX_CNT2_LMT.
*/
#define	MCDS_MCXLMT2	(MCDS_MCX_CNT2_LMT)

/** \\brief  A30, Counter Control Register */
#define MCDS_MCX_CNT3_CCL /*lint --e(923)*/ (*(volatile Ifx_MCDS_CNT_CCL*)0xF90E8A30u)

/** Alias (User Manual Name) for MCDS_MCX_CNT3_CCL.
* To use register names with standard convension, please use MCDS_MCX_CNT3_CCL.
*/
#define	MCDS_MCXCCL3	(MCDS_MCX_CNT3_CCL)

/** \\brief  A38, Current Count Register */
#define MCDS_MCX_CNT3_CNT /*lint --e(923)*/ (*(volatile Ifx_MCDS_CNT_CNT*)0xF90E8A38u)

/** Alias (User Manual Name) for MCDS_MCX_CNT3_CNT.
* To use register names with standard convension, please use MCDS_MCX_CNT3_CNT.
*/
#define	MCDS_MCXCNT3	(MCDS_MCX_CNT3_CNT)

/** \\brief  A34, Counter Limit Register */
#define MCDS_MCX_CNT3_LMT /*lint --e(923)*/ (*(volatile Ifx_MCDS_CNT_LMT*)0xF90E8A34u)

/** Alias (User Manual Name) for MCDS_MCX_CNT3_LMT.
* To use register names with standard convension, please use MCDS_MCX_CNT3_LMT.
*/
#define	MCDS_MCXLMT3	(MCDS_MCX_CNT3_LMT)

/** \\brief  A40, Counter Control Register */
#define MCDS_MCX_CNT4_CCL /*lint --e(923)*/ (*(volatile Ifx_MCDS_CNT_CCL*)0xF90E8A40u)

/** Alias (User Manual Name) for MCDS_MCX_CNT4_CCL.
* To use register names with standard convension, please use MCDS_MCX_CNT4_CCL.
*/
#define	MCDS_MCXCCL4	(MCDS_MCX_CNT4_CCL)

/** \\brief  A48, Current Count Register */
#define MCDS_MCX_CNT4_CNT /*lint --e(923)*/ (*(volatile Ifx_MCDS_CNT_CNT*)0xF90E8A48u)

/** Alias (User Manual Name) for MCDS_MCX_CNT4_CNT.
* To use register names with standard convension, please use MCDS_MCX_CNT4_CNT.
*/
#define	MCDS_MCXCNT4	(MCDS_MCX_CNT4_CNT)

/** \\brief  A44, Counter Limit Register */
#define MCDS_MCX_CNT4_LMT /*lint --e(923)*/ (*(volatile Ifx_MCDS_CNT_LMT*)0xF90E8A44u)

/** Alias (User Manual Name) for MCDS_MCX_CNT4_LMT.
* To use register names with standard convension, please use MCDS_MCX_CNT4_LMT.
*/
#define	MCDS_MCXLMT4	(MCDS_MCX_CNT4_LMT)

/** \\brief  A50, Counter Control Register */
#define MCDS_MCX_CNT5_CCL /*lint --e(923)*/ (*(volatile Ifx_MCDS_CNT_CCL*)0xF90E8A50u)

/** Alias (User Manual Name) for MCDS_MCX_CNT5_CCL.
* To use register names with standard convension, please use MCDS_MCX_CNT5_CCL.
*/
#define	MCDS_MCXCCL5	(MCDS_MCX_CNT5_CCL)

/** \\brief  A58, Current Count Register */
#define MCDS_MCX_CNT5_CNT /*lint --e(923)*/ (*(volatile Ifx_MCDS_CNT_CNT*)0xF90E8A58u)

/** Alias (User Manual Name) for MCDS_MCX_CNT5_CNT.
* To use register names with standard convension, please use MCDS_MCX_CNT5_CNT.
*/
#define	MCDS_MCXCNT5	(MCDS_MCX_CNT5_CNT)

/** \\brief  A54, Counter Limit Register */
#define MCDS_MCX_CNT5_LMT /*lint --e(923)*/ (*(volatile Ifx_MCDS_CNT_LMT*)0xF90E8A54u)

/** Alias (User Manual Name) for MCDS_MCX_CNT5_LMT.
* To use register names with standard convension, please use MCDS_MCX_CNT5_LMT.
*/
#define	MCDS_MCXLMT5	(MCDS_MCX_CNT5_LMT)

/** \\brief  A60, Counter Control Register */
#define MCDS_MCX_CNT6_CCL /*lint --e(923)*/ (*(volatile Ifx_MCDS_CNT_CCL*)0xF90E8A60u)

/** Alias (User Manual Name) for MCDS_MCX_CNT6_CCL.
* To use register names with standard convension, please use MCDS_MCX_CNT6_CCL.
*/
#define	MCDS_MCXCCL6	(MCDS_MCX_CNT6_CCL)

/** \\brief  A68, Current Count Register */
#define MCDS_MCX_CNT6_CNT /*lint --e(923)*/ (*(volatile Ifx_MCDS_CNT_CNT*)0xF90E8A68u)

/** Alias (User Manual Name) for MCDS_MCX_CNT6_CNT.
* To use register names with standard convension, please use MCDS_MCX_CNT6_CNT.
*/
#define	MCDS_MCXCNT6	(MCDS_MCX_CNT6_CNT)

/** \\brief  A64, Counter Limit Register */
#define MCDS_MCX_CNT6_LMT /*lint --e(923)*/ (*(volatile Ifx_MCDS_CNT_LMT*)0xF90E8A64u)

/** Alias (User Manual Name) for MCDS_MCX_CNT6_LMT.
* To use register names with standard convension, please use MCDS_MCX_CNT6_LMT.
*/
#define	MCDS_MCXLMT6	(MCDS_MCX_CNT6_LMT)

/** \\brief  A70, Counter Control Register */
#define MCDS_MCX_CNT7_CCL /*lint --e(923)*/ (*(volatile Ifx_MCDS_CNT_CCL*)0xF90E8A70u)

/** Alias (User Manual Name) for MCDS_MCX_CNT7_CCL.
* To use register names with standard convension, please use MCDS_MCX_CNT7_CCL.
*/
#define	MCDS_MCXCCL7	(MCDS_MCX_CNT7_CCL)

/** \\brief  A78, Current Count Register */
#define MCDS_MCX_CNT7_CNT /*lint --e(923)*/ (*(volatile Ifx_MCDS_CNT_CNT*)0xF90E8A78u)

/** Alias (User Manual Name) for MCDS_MCX_CNT7_CNT.
* To use register names with standard convension, please use MCDS_MCX_CNT7_CNT.
*/
#define	MCDS_MCXCNT7	(MCDS_MCX_CNT7_CNT)

/** \\brief  A74, Counter Limit Register */
#define MCDS_MCX_CNT7_LMT /*lint --e(923)*/ (*(volatile Ifx_MCDS_CNT_LMT*)0xF90E8A74u)

/** Alias (User Manual Name) for MCDS_MCX_CNT7_LMT.
* To use register names with standard convension, please use MCDS_MCX_CNT7_LMT.
*/
#define	MCDS_MCXLMT7	(MCDS_MCX_CNT7_LMT)

/** \\brief  800, Event Definition Register */
#define MCDS_MCX_EVT0 /*lint --e(923)*/ (*(volatile Ifx_MCDS_EVT*)0xF90E8800u)

/** Alias (User Manual Name) for MCDS_MCX_EVT0.
* To use register names with standard convension, please use MCDS_MCX_EVT0.
*/
#define	MCDS_MCXEVT0	(MCDS_MCX_EVT0)

/** \\brief  804, Event Definition Register */
#define MCDS_MCX_EVT1 /*lint --e(923)*/ (*(volatile Ifx_MCDS_EVT*)0xF90E8804u)

/** Alias (User Manual Name) for MCDS_MCX_EVT1.
* To use register names with standard convension, please use MCDS_MCX_EVT1.
*/
#define	MCDS_MCXEVT1	(MCDS_MCX_EVT1)

/** \\brief  828, Event Definition Register */
#define MCDS_MCX_EVT10 /*lint --e(923)*/ (*(volatile Ifx_MCDS_EVT*)0xF90E8828u)

/** Alias (User Manual Name) for MCDS_MCX_EVT10.
* To use register names with standard convension, please use MCDS_MCX_EVT10.
*/
#define	MCDS_MCXEVT10	(MCDS_MCX_EVT10)

