summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxMcds_reg.h
/** Alias (User Manual Name) for MCDS_TCX_IP1_BND.
* To use register names with standard convension, please use MCDS_TCX_IP1_BND.
*/
#define	MCDS_TCXIPBND1	(MCDS_TCX_IP1_BND)

/** \\brief  3014, Comparator Range Register */
#define MCDS_TCX_IP1_RNG /*lint --e(923)*/ (*(volatile Ifx_MCDS_TCXIP_RNG*)0xF90EB014u)

/** Alias (User Manual Name) for MCDS_TCX_IP1_RNG.
* To use register names with standard convension, please use MCDS_TCX_IP1_RNG.
*/
#define	MCDS_TCXIPRNG1	(MCDS_TCX_IP1_RNG)

/** \\brief  200C, Compact Function Trace Register */
#define MCDS_TCX_TCCFTREG /*lint --e(923)*/ (*(volatile Ifx_MCDS_TCX_TCCFTREG*)0xF90EA00Cu)

/** Alias (User Manual Name) for MCDS_TCX_TCCFTREG.
* To use register names with standard convension, please use MCDS_TCX_TCCFTREG.
*/
#define	MCDS_TCCFTREG	(MCDS_TCX_TCCFTREG)

/** \\brief  2480, Comparator Bound Register */
#define MCDS_TCX_WD0_BND /*lint --e(923)*/ (*(volatile Ifx_MCDS_TCXWD_BND*)0xF90EA480u)

/** Alias (User Manual Name) for MCDS_TCX_WD0_BND.
* To use register names with standard convension, please use MCDS_TCX_WD0_BND.
*/
#define	MCDS_TCXWDBND0	(MCDS_TCX_WD0_BND)

/** \\brief  2490, Comparator Mask Register */
#define MCDS_TCX_WD0_MSK /*lint --e(923)*/ (*(volatile Ifx_MCDS_TCXWD_MSK*)0xF90EA490u)

/** Alias (User Manual Name) for MCDS_TCX_WD0_MSK.
* To use register names with standard convension, please use MCDS_TCX_WD0_MSK.
*/
#define	MCDS_TCXWDMSK0	(MCDS_TCX_WD0_MSK)

/** \\brief  2488, Comparator Range Register */
#define MCDS_TCX_WD0_RNG /*lint --e(923)*/ (*(volatile Ifx_MCDS_TCXWD_RNG*)0xF90EA488u)

/** Alias (User Manual Name) for MCDS_TCX_WD0_RNG.
* To use register names with standard convension, please use MCDS_TCX_WD0_RNG.
*/
#define	MCDS_TCXWDRNG0	(MCDS_TCX_WD0_RNG)

/** \\brief  249C, Comparator Sign Register */
#define MCDS_TCX_WD0_SGN /*lint --e(923)*/ (*(volatile Ifx_MCDS_TCXWD_SGN*)0xF90EA49Cu)

/** Alias (User Manual Name) for MCDS_TCX_WD0_SGN.
* To use register names with standard convension, please use MCDS_TCX_WD0_SGN.
*/
#define	MCDS_TCXWDSGN0	(MCDS_TCX_WD0_SGN)

/** \\brief  24A0, Comparator Bound Register */
#define MCDS_TCX_WD1_BND /*lint --e(923)*/ (*(volatile Ifx_MCDS_TCXWD_BND*)0xF90EA4A0u)

/** Alias (User Manual Name) for MCDS_TCX_WD1_BND.
* To use register names with standard convension, please use MCDS_TCX_WD1_BND.
*/
#define	MCDS_TCXWDBND1	(MCDS_TCX_WD1_BND)

/** \\brief  24B0, Comparator Mask Register */
#define MCDS_TCX_WD1_MSK /*lint --e(923)*/ (*(volatile Ifx_MCDS_TCXWD_MSK*)0xF90EA4B0u)

/** Alias (User Manual Name) for MCDS_TCX_WD1_MSK.
* To use register names with standard convension, please use MCDS_TCX_WD1_MSK.
*/
#define	MCDS_TCXWDMSK1	(MCDS_TCX_WD1_MSK)

/** \\brief  24A8, Comparator Range Register */
#define MCDS_TCX_WD1_RNG /*lint --e(923)*/ (*(volatile Ifx_MCDS_TCXWD_RNG*)0xF90EA4A8u)

/** Alias (User Manual Name) for MCDS_TCX_WD1_RNG.
* To use register names with standard convension, please use MCDS_TCX_WD1_RNG.
*/
#define	MCDS_TCXWDRNG1	(MCDS_TCX_WD1_RNG)

/** \\brief  24BC, Comparator Sign Register */
#define MCDS_TCX_WD1_SGN /*lint --e(923)*/ (*(volatile Ifx_MCDS_TCXWD_SGN*)0xF90EA4BCu)

/** Alias (User Manual Name) for MCDS_TCX_WD1_SGN.
* To use register names with standard convension, please use MCDS_TCX_WD1_SGN.
*/
#define	MCDS_TCXWDSGN1	(MCDS_TCX_WD1_SGN)

/** \\brief  408, Clock Counter Register */
#define MCDS_TSUEMUCNT /*lint --e(923)*/ (*(volatile Ifx_MCDS_TSUEMUCNT*)0xF90E8408u)

/** \\brief  404, Clock Prescaler Register */
#define MCDS_TSUPRSCL /*lint --e(923)*/ (*(volatile Ifx_MCDS_TSUPRSCL*)0xF90E8404u)

/** \\brief  400, Clock Counter Register */
#define MCDS_TSUREFCNT /*lint --e(923)*/ (*(volatile Ifx_MCDS_TSUREFCNT*)0xF90E8400u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXMCDS_REG_H */
